[
    {
        "id": "adecs",
        "title": "Nutrition and Cancer",
        "teacher": "Abdullah Al Mahfuz",
        "description": "Cancer has overtaken cardiovascular disease (CVD) as the leading cause of death in many parts of the world. It causes one in eight deaths worldwide. Global trends show that the majority of all cancer deaths occur in the low- and middle-income countries. Yet, cancer can be partly prevented and many of these deaths can be avoided.<br> Discover the latest insights on the role of diet, nutrition and lifestyle in the prevention, occurrence and progression of cancer in the open and online course Nutrition and Cancer.",
        "course_length": 5,
        "hours": 8,
        "pace": "Self",
        "premium": false,
        "about": "Can cancer risk be reduced through a healthy diet or lifestyle? Many studies have been conducted on the role of nutrition and physical activity in cancer prevention. This has resulted in recommendations for cancer prevention. Far less research is conducted on nutrition and cancer progression, but the evidence is increasing that a healthy diet may also play a beneficial role for cancer survivors. Join this online course and learn more about the role of nutrition in the occurrence and progression of cancer. You will learn how nutrition is involved in cancer occurrence, cancer treatment, and progression. And you will discover what the evidence-base is for dietary guidelines.",
        "topics": [
            "Study designs to investigate the relation between nutrition and cancer",
            "Diet- and lifestyle-related risk factors for cancer development and survival",
            "The mechanisms by which nutrition impacts cancer",
            "Guidelines for primary and tertiary cancer prevention for the general public and for survivors",
            "Understand the evidence-base for dietary guidelines"
        ],
        "syllabus": [
            "Start with an introduction to the relation between nutrition and cancer development and progression, and discuss the different types of research designs by which this relation is studied.",
            "Discuss dietary and lifestyle risk factors related to cancer occurrence, by outlining the current WCRF/IARC evidence-based recommendations for cancer prevention.",
            "Learn about the interaction between nutrition and genes, and how this can influence cancer occurrence.",
            "Learn about the importance of dietary and lifestyle guidelines for the increasing group of cancer survivors.",
            "In this module you will learn about the adherence to guidelines and how important it is to have a clear and correct communication to the public."
        ],
        "img": "https://i.ibb.co/fDjJ4Tw/Pink-ribbon-stethoscope-dark-background.jpg",
        "price": 40.9
    },
    {
        "id": "bdecs",
        "title": "Nutrition, Heart Disease and Diabetes",
        "teacher": "Abdullah Al Mahfuz",
        "description": "Discover the latest insights on the importance of nutrition and lifestyle in the development and treatment of cardiovascular diseases and diabetes mellitus in the online open course Nutrition, Heart disease and Diabetes. You will learn about current progress in research on diabetes, cardiovascular disease and other cardiometabolic disorders and you will discover how these cardiometabolic diseases can be prevented in individuals and populations through lifestyle and dietary modifications.",
        "course_length": 5,
        "hours": 8,
        "pace": "Self",
        "premium": false,
        "about": "Learn about the role of nutrition in relation to diseases of the circulatory system and diabetes, which are major causes of death worldwide. You'll learn about the etiology of heart attacks, type 2 diabetes, stroke, other forms of cardiovascular diseases and how often these occur worldwide. You will learn about biological modifiable risk factors, such as blood pressure, blood cholesterol and obesity, and how they impact these diseases in a different way. After completing this course you will also have gained adeeper insight in underlying pathophysiological mechanisms, such as insulin resistance, and the role of (epi)genetic factors.Dieticians and doctors often get questions from their patients on what they can do to improve their health. In this course,part of the Professional Certificate Program Nutrition and Disease, you will learn about the interaction between nutrients, diets and cardiometabolic disease (heart disease and diabetes).",
        "topics": [
            "Understand the role of dietary factors in the occurrence, progression and treatment of cardiometabolic diseases",
            "Understand the biological processes that contribute to cardiovascular disease, type 2 diabetes and other cardiometabolic disorders",
            "Guidelines for primary prevention",
            "The role of epigenetics and genetic factors",
            "The interaction between nutrients, diets and cardiometabolic disease"
        ],
        "syllabus": [
            " Cardiometabolic Disease Risk : In this module you will be introduced to the different types of cardiometabolic diseases, including cardiovascular disease and diabetes. Furthermore both biological and environmental risk factors for these diseases such as age, blood pressure and physical exercise will be presented.",
            "Role of diet-Prevention of Cardiometabolic Disease: The role of macronutrient and food intake in relation to cardiometabolic disease prevention will be presented in this module. You will gain knowledge about the importance and development of dietary guidelines for the prevention of disease.",
            "Pathophysiology of Cardiometabolic Disease: Learn about the pathophysiology and processes that contribute to the development of diabetes and cardiovascular disease. Amongst others, insulin resistance, adipose tissue, inflammation, blood lipids and ischemia and reperfusion injury will be discussed.",
            "Molecular Aspects: In this module you will learn about genetic and epigenetic practices in relation to nutrition and cardiometabolic diseases including EWAS, GWAS, diet-gene interactions, DNA methylation and Mendelian Randomisation.",
            "Nutritional Strategies to Reduce Cardiometabolic Diseases:This final module describes some directions for reducing the burden of cardiometabolic diseases. Several dietary patterns, the focus of future scientific research and actions of different stakeholders are discussed."
        ],
        "img": "https://i.ibb.co/d68QTRJ/Realistic-human-heart.jpg",
        "price": 40.9
    },
    {
        "id": "cdecs",
        "title": "Nutrition and Health: Food Safety",
        "teacher": "Abdullah Al Mahfuz",
        "description": "Learn about bacteria, pesticides and health hazards present in food. This online course is offered as a MOOC which means that you can study at your own pace, at your own time and anywhere you want.",
        "course_length": 8,
        "hours": 8,
        "pace": "Self",
        "premium": false,
        "about": "Everyday reports of food scandals and recalls are published. One day it's scary bacteria in meat, and another day it's dangerous pesticides in fruits. According to some, meat needs to be cooked well to prevent food-borne illness while others warn not to heat food to prevent the formation of poisonous substances. Many consumers worry about the conflicting and confusing messages about food hazards. This nutrition and health course will teach you about the risk factors associated with food and give you the tools to assess and quantify the dangers they can present. You will learn about food safety, the effects of food processing, the shared responsibility in the food chain and the prevention of food poisoning. After this course, you will be able to differentiate what is a food myth and what is an actual health risk. Finally, you will gain a contemporary view of how different risks can be weighed in a scientific way.",
        "topics": [
            " Overview of food hazards",
            "Elementary knowledge on microbiological and toxicological risk analysis",
            "How to better interpret the information overload about hazards in food",
            "Why zero hazard does not exist",
            " Ways to reduce hazards in food"
        ],
        "syllabus": [
            "Hazards and risks in the modern food chain:Introduction to the difference between a hazard and a risk, the different types of hazards present in food and the perception of risk by public.",
            "Interpretation of risks, probability and relevance: Introduction to risk reporting, how ways of presenting information can mislead consumers and difference between significance and relevance.",
            "Microorganisms in food: good, bad and/or a nuisance:Introduction to ubiquitous, good/bad or spoiling microorganisms.",
            "Qualitative and quantitative principles food safety of chemicals:Classification of risks as avoidable or unavoidable, difference between genotoxic and non-genotoxic compounds and examples of important genotoxic carcinogens present in the food chain as well as introduction to dose-response concept.",
            "Toxicological risk assessment:Introduction to risk assessment framework, different ways of performing risk assessments depending on the nature of the chemical (i.e. genotoxic vs. non genotoxic) and hands on risk assessment of the food additive cyclamate and the carcinogen acrylamide.",
            " Microbiological risk assessment: Introduction to contamination routes, dose-response relationship and effect of temperature on microorganisms' growth as well as sampling and legal requirements.",
            "Ways to reduce risks in food: Introduction to prevention of avoidable hazard, effect of heat on hazards and inactivation as well as prevention techniques to reduce risks in food.",
            "Final assignment/exam: Wrap-up."
        ],
        "img": "https://i.ibb.co/D5wscVw/Hand-holding-blood-glucose-meter-measuring-blood-sugar-background-is-stethoscope-chart-file2.jpg",
        "price": 40.9
    },
    {
        "id": "ddecs",
        "title": "Nutrition and Health: Micronutrients and Malnutrition",
        "teacher": "Natalie Portman",
        "description": "Learn from the top professors of Wageningen University & Research about malnutrition and micronutrients and how they impact your health. This online course is offered as a MOOC, and is part of the Professional Certificate Pogramme: Nutrition and Health.",
        "course_length": 7,
        "hours": 8,
        "pace": "Self",
        "premium": false,
        "about": "There is an overload of information about nutrition and health, but what is the truth and what can you do to improve the health of your patients? Learn more about nutrition and how our diet profoundly impacts our current and future health. This course addresses the relationship between nutrition and human health, with a focus on health problems related to malnutrition. In this course, Professor Sander Kersten from Wageningen University & Research will explain about the micronutrient (vitamins, minerals, and trace elements) content of foods. You will learn about their role in the body and their impact on our health. Moreover, this course will discuss how suboptimal nutrition may affect human health, with particular attention to malnutrition and global hunger. You will learn about strategies to improve and combat these problems of malnutrition. Finally, the course will make you familiar with nutritional research and research methodologies.",
        "topics": [
            "Introduction to the field of food and nutrition",
            "Composition of foods",
            "Basic chemistry of vitamins and minerals",
            "The role of vitamins and minerals in the body",
            "The Impact of malnutrition on global disease burden",
            "Nutritional strategies to improve nutritional status and combat malnutrition",
            "How to better weigh and interpret the information about nutrition and health"
        ],
        "syllabus": [
            "Basic Principles of micronutrients: Start the course by learning about the general principles that apply to vitamins and minerals.",
            "Water, minerals, trace elements: In this module you will look at the health effects of water, and will cover the various dietary minerals.",
            "Fat soluble vitamins and heal: Learn about the fat soluble vitamins: vitamin A, vitamin D and vitamin E.",
            "Water soluble vitamins and health:For this module, you'll shift your focus to a few of the water soluble vitamins: vitamin C, folate and vitamin B12.",
            "The global burden of micronutrient malnutrition:Discuss the prevalence and trends of micronutrient deficiencies and their geographical distribution. We will also talk about the double burden of malnutrition.",
            "Global solutions to micronutrient deficiencies: This module will outline the available strategies to alleviate micronutrient malnutrition.",
            "Insight in the future of Nutritional Science (verified learners only): In this module you will get to see some of the exciting research that is currently being done in the field of Nutritional Science."
        ],
        "img": "https://i.ibb.co/DM9SbH4/36518462.jpg",
        "price": 40.9
    },
    {
        "id": "edecs",
        "title": "Nutrition and Health: Macronutrients and Overnutrition",
        "teacher": "Abdullah Al Mahfuz",
        "description": "Learn from the top professors of Wageningen University & Research about macronutrients and overnutrition and how they impact humans. This online course is offered as a MOOC, and is part of the Professional Certificate Pogramme: Nutrition and Health",
        "course_length": 9,
        "hours": 8,
        "pace": "Self",
        "premium": false,
        "about": "Food plays a central role in our society but few people actually understand what it does to our bodies. Learn more about nutrition and how our diet profoundly impacts our current and future health. This introductory nutrition course addresses the relationship between nutrition and human health with a focus on health problems related to overnutrition. In this course, Professor Sander Kersten from Wageningen University will introduce you to the chemistry of the three macronutrients fat, carbohydrate and protein. You will learn how macronutrients are absorbed, stored, and metabolized for energy, and you will gain a contemporary view of how different types of fats, carbohydrates and proteins affect human health. Moreover, the course will cover energy homeostasis and the regulation of bodyweight, and provides ample coverage of the topic of obesity. Finally, it will make you familiar with nutritional research and research methodologies.",
        "topics": [
            "Introduction to the field of food and nutritionComposition of foods",
            "Basic chemistry of carbohydrates, fat and protein",
            "How macronutrients are absorbed, stored and metabolized",
            "How macronutrients may impact health",
            "How to better weigh and interpret the information overload about nutrition and health"
        ],
        "syllabus": [
            "Basic Principles: In the first module you will be introduced into the basic nutritional science and you will learn about the different study designs that are used in nutrition research.",
            "Carbohydrates: In this module you will be introduced to the basics of carbohydrates.",
            "Carbohydrates and Health (verified learner only): In this module we will focus on the health effects of one specific group of carbohydrates: sugar.",
            "Lipids: This module will teach you the basics of fats or lipids.",
            "Lipids and Health (verified learner only): This module will start out by discussing cardiovascular (heart) disease and risk factors for cardiovascular disease, and will go on to explore the effects of fatty acids on cholesterol.",
            "Proteins and Health: The module starts with the basics of dietary protein, and will go on to address the question of what specific health effects can be attributed to dietary protein.",
            "Energy homeostasis sand energy balance: In this module we will look at the balance between food (energy) intake and exergy expenditure.",
            "Weight management: This module concentrates on weight management and the topic of obesity.",
            "Nutrition and Sports (verified learner only): In this extra module we look at the impact of nutrition on exercise"
        ],
        "img": "https://i.ibb.co/n1LL528/Healthy-food-medical-equipment2.jpg",
        "price": 40.9
    },
    {
        "id": "fdecs",
        "title": "Nutrition, Exercise and Sports",
        "teacher": "Leonardo DiCaprio",
        "description": "Learn about Nutrition, Exercise and Sports and understand how nutrition can support exercise and sports performance.",
        "course_length": 6,
        "hours": 8,
        "pace": "Self",
        "premium": false,
        "about": "Are you involved in sports or regular exercise and do you want to have a better understanding of the role of nutrition on performance and health? Do you want to learn whether certain nutritional strategies could be relevant for your own athletic performance and/or muscle growth? Are you a dietitian, personal trainer, physiotherapist or a health/sport coach and do you want to be able to provide proper nutritional advice for your clients? Or, are you none of the above but interested in nutrition, exercise and sports and do you want to make your own informed decisions about your daily food intake?  Then this online course Nutrition, Exercise and Sports is for you! Nutrition is crucial to live an active and healthy life, to support training, and to optimize performance. In this online course, researchers and teachers from Wageningen University & Research will familiarize you with the nutritional aspects of exercise and sports. What are the basic concepts in exercise physiology and sport nutrition science? How is exercise being fueled for the different types of sports like; power sports, sprinting and endurance exercise? And how does protein support skeletal muscle mass and performance? In this online course you will learn to estimate energy needs and understand thermoregulation and fluid balance. You will learn about the role of micronutrients and supplements in exercise performance. Moreover, you will be introduced to some health issues related to doing exercise. This online course also touches upon how the lessons learned from nutrition and sports research can be applied during ageing. For example, what are the benefits of extra protein in vulnerable age groups?Be aware that this course will not tell you exactly what to eat. Instead, you will learn and understand the nutritional aspects of exercise and sport, so you can make your own informed decisions and critically evaluate nutritional advices and claims.",
        "topics": [
            "The key concepts of exercise physiology and sports nutrition science",
            "Important nutritional aspects of exercise including energy, carbohydrates & fat protein metabolism and fluid balance",
            "Why certain nutritional strategies can enhance exercise and sports performance",
            "The role of micronutrients and supplements in exercise and sports",
            "The relationship between Exercise, Nutrition and Health, also during ageing",
            "Develop a critical mind-set in the field of Nutrition, Exercise and Sports"
        ],
        "syllabus": [
            " An introduction into Sports, Exercise and Nutrition, including types of Sports, Sport Nutrition Pyramid. An introduction into Sport Nutrition Science - including empirical cycle, study designs, critical issues and performance measurements.",
            "An introduction into Skeletal muscle anatomy & physiology, including contraction and energy transfer. Exercise capacity: Power & Endurance. Cardiopulmonal system during Exercise",
            " Energy requirement, energy availability. Thermoregulation, Fluid balance, (de)hydration & rehydration strategies",
            "Carbohydrates & fats as energy source, nutritional strategies. Skeletal muscle protein metabolism and dietary protein intake.",
            " Function of micronutrients and recommendations: Iron, Magnesium, calcium and Vitamins D and B. Ergogenic supplements and sports performance",
            " Skeletal muscle and ageing, Protein & Exercise in older adults, Intervention strategies"
        ],
        "img": "https://i.ibb.co/WsMYC7G/Dumbbells-fitness.jpg",
        "price": 40.9
    }
]